cask_args appdir: '/Applications'

# devtools
brew 'ag'
brew 'awscli'
tap 'codeclimate/formulae'
brew 'codeclimate'
brew 'ctags'
brew 'direnv'
brew 'fzf'
brew 'git'
tap 'git-duet/tap'
brew 'git-duet'
brew 'golang'
tap 'heroku/brew'
brew 'heroku'
brew 'imagemagick'
brew 'instantclient-basic'
brew 'instantclient-sdk'
brew 'instantclient-sqlplus'
brew 'jq'
brew 'neovim'
brew 'nodenv'
tap 'ouchxp/nodenv'
brew 'nodenv-nvmrc'
brew 'nodejs'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'ripgrep'
brew 'terraform'
brew 'tig'
brew 'tree'
brew 'wget'
brew 'yarn'

# apps
cask '1password'
cask '1password-cli'
cask 'acorn'
cask 'charles'
cask 'chromedriver'
cask 'docker'
cask 'fantastical'
cask 'firefox'
cask 'gitup'
cask 'google-chrome'
cask 'hammerspoon'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'launchbar'
cask 'ngrok'
cask 'oracle-jdk'
cask 'paw'
cask 'postgres'
cask 'rubymine'
cask 'sketch'
cask 'slack'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'zoomus'
