cask_args appdir: '/Applications'

# devtools
brew 'ag'
brew 'awscli'
brew 'ctags'
brew 'direnv'
brew 'fzf'
brew 'git'
tap 'git-duet/tap'
brew 'git-duet'
brew 'golang'
tap 'heroku/brew'
brew 'heroku'
brew 'imagemagick'
brew 'lastpass-cli'
brew 'neovim'
brew 'nodejs'
brew 'phantomjs'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'ripgrep'
brew 'terraform'
brew 'tig'
brew 'tmate'
brew 'tree'
brew 'wget'

# apps
cask 'atom'
cask 'sublime-text'
cask 'google-chrome'
cask 'iterm2'
cask 'ngrok'
cask 'notion'
cask 'paw'
cask 'postgres'
cask 'rubymine'
cask 'slack'
cask 'zoomus'
cask 'firefox'
cask 'charles'
cask 'gitup'
cask 'chromedriver'
cask 'hammerspoon'
cask 'launchbar'
cask 'sketch'
cask 'boostnote'
cask 'intellij-idea-ce'
cask 'java'
