cask_args appdir: '/Applications'

# devtools
brew 'ag'
brew 'awscli'
brew 'ctags'
brew 'direnv'
brew 'fzf'
brew 'git'
brew 'git-duet/tap/git-duet'
brew 'golang'
brew 'heroku/brew/heroku'
brew 'lastpass-cli'
brew 'neovim'
brew 'nodejs'
brew 'phantomjs'
brew 'postgresql'
brew 'python3'
brew 'rbenv'
brew 'terraform'
brew 'tig'
brew 'tmate'
brew 'tree'
brew 'wget'

# apps
cask 'atom'
cask 'sublime-text'
cask 'flycut'
cask 'google-chrome'
cask 'iterm2'
cask 'ngrok'
cask 'notion'
cask 'paw'
cask 'postgres'
cask 'rubymine'
cask 'slack'
cask 'spectacle'
cask 'zoomus'
cask 'firefox'
cask 'charles'
